import java.io.IOException;

public class Exam3 {

	public static void main(String[] args) throws IOException {
		// TODO 예제3
		/*
		 * 1.'.'이 입력될 때까지 키보드 입력을 읽어오는 프로그램 
		 * 입력된 공백 문자의 수를 세고, 그 총합을 프로그램 마지막에 출력할 수 있도록 작성
		 * ??...
		 * 계속 입력하다가 .을치고 엔터를치면 종료되고 그동안 입력됐던것을 출력, 공백을 센다..
		 * 공백을 센다.
		 * 이것도 아스키코드로,, ?.. 근데어떻게?..
		 * 
		 * 
		 */
		
		
		/*
		 * 2.키보드로 문자를 입력받아서 소문자는 대문자로, 대문자는 소문자로 변경시켜 출력하는 프로그램(toupper, tolower)
		 * '.'이 입력되면 종료, 마지막에 대/소문자의 수를 출력 
		 * +아스키 코드니까 32를 해주는 방법..??
		 */
		
	}

}
